JeanOlivotto/robot_assistant/firmware/sdkconfig.defaults
# Comum a todos os chips. Específico do chip vai em sdkconfig.defaults.<target>.
CONFIG_IDF_TARGET="esp32c3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y
